app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-01-24 20:14:15.986650"], ["updated_at", "2019-01-24 20:14:15.986650"]]
---
  def create
    @school_class = SchoolClass.create school_class_params(:title, :room_number)

UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["updated_at", "2019-01-24 20:14:16.518580"], ["id", 1]]
---
  def update
    set_schoolclass
    @school_class.update school_class_params(:title)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_schoolclass
    @school_class = SchoolClass.find(params[:id])