app/controllers/students_controller.rb

  def create
    @student = Student.create student_params(:first_name, :last_name)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2019-01-24 20:12:55.175511"], ["updated_at", "2019-01-24 20:12:55.175511"]]

  def update
    set_student
    @student.update student_params(:first_name, :last_name)
---
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-01-24 20:12:55.815397"], ["id", 1]]